Revit 2024 API
Transform2D Methods
The Transform2D type exposes the following members.
Methods
Name | Description
AlmostEqual
 Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Assign
 Assigns values from the input transformation to this transformation.
CreateIdentity
 Creates the identity transformation.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInverse
 Gets the inverse transformation of this transformation.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Multiply
 Multiplies this transformation by the specified transformation and returns the result.
OfPoint
 Applies the transformation to the point and returns the result.
OfVector
 Applies the transformation to the vector and returns the result.
PostScale
 Scales both the linear and translational parts of this transformation and returns the result.
PreScale
 Scales the linear part of this transformation and returns the result.
SetToIdentity
 Set this TrfUV to the identity transform.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
TransformUVDomainIfPossible
 Transforms an envelope (BoundingBoxUV) for one surface to an envelope for a coincident but differently parameterized surface.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace